d = {"Иванов Петр Сергеевич": {"оклад:" 5000, "должность":менеджер, график: [1.2.3]}}

staff = {
    "Иванов П.С.": {
        "ТН": "001",
        "Дата рождения": "17.10.1980", 
        "Адрес":"ул. Ленина, 43",
        "Пол":"М",
        "Возраст":
        "Телефон":
        "Должность":
        "Оклад":
        отдел(подразделение)
        семейное положение
        "email": "tom12@gmail.com"
    },
    "Bob": {
        "phone": "+876390444",
        "email": "bob@gmail.com",
        "skype": "bob123"
    }
}

'''Сотрудники:
    ФИО, - ключ внешнего словаря
    Дальше ключи  вложенного словаря-значения
    ID (таб.номер)
    Дата рождения,
    Адрес
    Пол
    Возраст
    Телефон
    должность
    оклад
    отдел(подразделение)
    семейное положение
    email
    дата приема'''
